----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 48, 67, 121]           1,152
       BatchNorm2d-2          [-1, 48, 67, 121]              96
              ReLU-3          [-1, 48, 67, 121]               0
            Conv2d-4          [-1, 256, 17, 31]          81,920
       BatchNorm2d-5          [-1, 256, 17, 31]             512
              ReLU-6          [-1, 256, 17, 31]               0
            Conv2d-7          [-1, 256, 17, 31]         737,280
       BatchNorm2d-8          [-1, 256, 17, 31]             512
              ReLU-9          [-1, 256, 17, 31]               0
           Conv2d-10          [-1, 256, 17, 31]         737,280
      BatchNorm2d-11          [-1, 256, 17, 31]             512
             ReLU-12          [-1, 256, 17, 31]               0
           Conv2d-13          [-1, 256, 17, 31]         737,280
      BatchNorm2d-14          [-1, 256, 17, 31]             512
             ReLU-15          [-1, 256, 17, 31]               0
AdaptiveAvgPool2d-16            [-1, 320, 1, 1]               0
           Conv2d-17            [-1, 256, 1, 1]          81,920
      BatchNorm2d-18            [-1, 256, 1, 1]             512
             ReLU-19            [-1, 256, 1, 1]               0
           Conv2d-20          [-1, 256, 17, 31]         327,680
      BatchNorm2d-21          [-1, 256, 17, 31]             512
             ReLU-22          [-1, 256, 17, 31]               0
          Dropout-23          [-1, 256, 17, 31]               0
             ASPP-24          [-1, 256, 17, 31]               0
           Conv2d-25         [-1, 256, 67, 121]         700,416
      BatchNorm2d-26         [-1, 256, 67, 121]             512
             ReLU-27         [-1, 256, 67, 121]               0
           Conv2d-28           [-1, 5, 67, 121]           1,285
================================================================
Total params: 3,409,893
Trainable params: 3,409,893
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 125167.65
Forward/backward pass size (MB): 74.22
Params size (MB): 13.01
Estimated Total Size (MB): 125254.88
----------------------------------------------------------------
